/* State and Keywordgroupnames */
"/Ruby/Literals" = "Literals";
"/Ruby/Attribute Definitions" = "Attribute Definitions";
"/Ruby/Definitions" = "Definitions";
"/Ruby/Keywords" = "Keywords";
"/Ruby/Builtin Functions" = "Builtin Functions";
"/Ruby/Builtin Globals" = "Builtin Globals";
"/Ruby/Builtin Classes" = "Builtin Classes";
"/Ruby/Symbols" = ":symbols";
"/Ruby/Numbers" = "Numbers";
"/Ruby/Instance Variables" = "Instance Variables";
"/Ruby/Class Variables" = "Class Variables";
"/Ruby/Global Variables" = "Global Variables";
"/Ruby/String with double quotes" = "\"Strings\"";
"/Ruby/test" = "#{Embedded expressions}";
"/Ruby/String with single quotes" = "'Strings'";
"/Ruby/Backticks" = "`Backticks`";
"/Ruby/Singleline Comment" = "# Comment";
"/Ruby/Regexp" = "Regular expression";
"/Ruby/POD Comments" = "POD Comments";
"/Ruby/HTML" = "HTML";
"/Ruby/Tags" = "HTML Tags";
"/Ruby/Attributes" = "HTML Attributes";
"/Ruby/Strings" = "HTML Strings";
"/Ruby/ERB Delimiter" = "<%ERB Delimiter%>";
"/Ruby/HTMLComment" = "<!-- comment -->";
"/Ruby/Heredoc" = ">>HEREDOC String";
"/Ruby/Hexadecimal Characters" = "Hexadecimal Characters";
